pchwalek/env_glasses/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN APP_BLE_Init_3 */
//  DTS_STM_Init();
//  DTC_App_Init();
//  startThreads();
  startInitThread();

  ledDisconnectNotification();

//#else
//
//	SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet = { { { 0, 0, 0 } }, /**< Header unused */
//	{ 0, /** pBleBufferAddress not used */
//	0, /** BleBufferSize not used */
//	CFG_BLE_NUM_GATT_ATTRIBUTES,
//	CFG_BLE_NUM_GATT_SERVICES,
//	CFG_BLE_ATT_VALUE_ARRAY_SIZE,
//	CFG_BLE_NUM_LINK,
//	CFG_BLE_DATA_LENGTH_EXTENSION,
//	CFG_BLE_PREPARE_WRITE_LIST_SIZE,
//	CFG_BLE_MBLOCK_COUNT,
//	CFG_BLE_MAX_ATT_MTU,
//	CFG_BLE_SLAVE_SCA,
//	CFG_BLE_MASTER_SCA,
//	CFG_BLE_LSE_SOURCE,
//	CFG_BLE_MAX_CONN_EVENT_LENGTH,
//	CFG_BLE_HSE_STARTUP_TIME,
//	CFG_BLE_VITERBI_MODE,
//	CFG_BLE_OPTIONS, 0,
//	CFG_BLE_MAX_COC_INITIATOR_NBR,
//	CFG_BLE_MIN_TX_POWER,
//	CFG_BLE_MAX_TX_POWER } };
//
//	/**
//	 * Initialize Ble Transport Layer
//	 */
//	Ble_Tl_Init();
//
//	/**
//	 * Do not allow standby in the application
//	 */
//	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);
//
//	/**
//	 * Register the hci transport layer to handle BLE User Asynchronous Events
//	 */
//	HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL,
//			&HciUserEvtProcess_attr);
//
//	/**
//	 * Starts the BLE Stack on CPU2
//	 */
//	if (SHCI_C2_BLE_Init(&ble_init_cmd_packet) != SHCI_Success) {
//		Error_Handler();
//	}
//
//	/**
//	 * Initialization of HCI & GATT & GAP layer
//	 */
//	Ble_Hci_Gap_Gatt_Init();
//
//	/**
//	 * Initialization of the BLE Services
//	 */
//	SVCCTL_Init();
//
//	/**
//	 * Initialization of the BLE App Context
//	 */
//	BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
//	BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;
//	/**
//	 * From here, all initialization are BLE application specific
//	 */
//	AdvUpdateProcessId = osThreadNew(AdvUpdateProcess, NULL,
//			&AdvUpdateProcess_attr);
//
//	/**
//	 * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
//	 */
//#if(BLE_CFG_OTA_REBOOT_CHAR != 0)
//  manuf_data[sizeof(manuf_data)-8] = CFG_FEATURE_OTA_REBOOT;
//#endif
//
//	LinkConfigProcessId = osThreadNew(LinkConfiguration, NULL,
//			&LinkConfigProcess_attr);
//
//	DTC_App_Init();
//#endif

//#ifndef CUSTOM_BT_PARAMETERS
/* USER CODE END APP_BLE_Init_3 */

  /**
   * Create timer to handle the connection state machine
   */

  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;

//  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_128_BIT_SERV_UUID;
//  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;

    Add_Advertisment_Service_UUID(DATA_TRANSFER_SERVICE_UUID);
//  Add_Advertisment_Service_UUID_128(DT_REQ_CHAR_UUID);


  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
  * Start to Advertise to be connected by Collector
   */
   Adv_Request(APP_BLE_FAST_ADV);

/* USER CODE BEGIN APP_BLE_Init_2 */
//#else
//
//	/**
//	 * Create timer to handle the connection state machine
//	 */
//
//	HW_TS_Create(CFG_TIM_PROC_ID_ISR,
//			&(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot,
//			Adv_Mgr);
//
//	/**
//	 * Make device discoverable
//	 */
//	BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = 0; // AD_TYPE_16_BIT_SERV_UUID
//	BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
//	Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);
//	/* Initialize intervals for reconnexion without intervals update */
//	AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
//	AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
//
//	/**
//	 * Start to Advertise to be connected by Collector
//	 */
//	Adv_Request(APP_BLE_FAST_ADV);
//
////	InitThreads();
//#endif
/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_blecore_aci *blecore_evt;
  hci_le_phy_update_complete_event_rp0 *evt_le_phy_update_complete;
  uint8_t TX_PHY, RX_PHY;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  /* USER CODE BEGIN SVCCTL_App_Notification */
//#ifndef CUSTOM_BT_PARAMETERS
  /* USER CODE END SVCCTL_App_Notification */

  switch (event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *disconnection_complete_event;
      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
      }

      /* restart advertising */
      Adv_Request(APP_BLE_FAST_ADV);


      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
  		/* restart advertising */
      ledDisconnectNotification();

//#else
//	switch (event_pckt->evt) {
//	case HCI_DISCONNECTION_COMPLETE_EVT_CODE: {
//		hci_disconnection_complete_event_rp0 *disconnection_complete_event;
//		disconnection_complete_event =
//				(hci_disconnection_complete_event_rp0*) event_pckt->data;
//
//		if (disconnection_complete_event->Connection_Handle
//				== BleApplicationContext.BleApplicationContext_legacy.connectionHandle) {
//			BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
//			BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
//
//			APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
//		}
//
//
//#endif
#ifndef DYNAMIC_MODE
  		Adv_Request(APP_BLE_FAST_ADV);
  #else
		osThreadFlagsSet(AdvUpdateProcessId, 1);
		//		Adv_Request(APP_BLE_LP_ADV);
#endif
//		enableBlueLED_PWM(false, 0);
//		enableGreenLED_PWM(true, 150);
      /* USER CODE END EVT_DISCONN_COMPLETE */
    }

    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
          APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");

